[{"Title": "CSC 262-1 Computational Introduction to Statistics", "Days": "TR", "Term": "Fall 2023", "Credit": "  4.0", "Open": true, "Start": 1400, "End": 1515, "Room": "Wegmans Room 1400", "Capacity": "150", "Enrolled": "44", "Instructor": "Bruce Blaine", "Description": "This course will cover foundational concepts in descriptive analyses, probability, and statistical inference. \nTopics to be covered include data exploration through descriptive statistics (with a heavy emphasis on using R for such analyses), elementary probability, diagnostic testing, combinatorics, random variables,  elementary distribution theory, statistical inference, and statistical modeling. The inference portion of the course will focus on building and applying hypothesis tests and confidence intervals for population means, proportions, variances, and correlations. Non-parametric alternatives will also be introduced. The modeling portion of the course will include ANOVA, and simple and multiple regression and their respective computational methods. Students will be introduced to the R statistical computing environment. \nPREREQUISITES: MTH 150 or MTH 150A; AND MTH 142 or MTH 161 or MTH 171\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "CSC 161-1 Introduction to Programming", "Days": "MW", "Term": "Fall 2023", "Credit": "  4.0", "Open": true, "Start": 1650, "End": 1805, "Room": "Hoyt Hall Room 104", "Capacity": "200", "Enrolled": "195", "Instructor": "Monika Polak", "Description": "Hands-on introduction to programming using the Python programming language. Covers basic programming constructs including statements, expressions, variables, conditionals, iteration, and functions, as well as object-oriented programming and graphics.\nThis course is for non-majors and/or students with less math and science background.\nLab and workshop required.\nThis course may not be used for CSC major credit if completed after or at the same time as CSC171\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "CSC 252-1 Computer Organization", "Days": "MW", "Term": "Fall 2023", "Credit": "  4.0", "Open": true, "Start": 1525, "End": 1640, "Room": "Wegmans Room 1400", "Capacity": "75", "Enrolled": "63", "Instructor": "John Criswell", "Description": "Introduction to computer architecture and the layering of hardware/software systems. Topics include instruction set design; logical building blocks; computer arithmetic; processor organization; the memory hierarchy (registers, caches, main memory, and secondary storage); I/O buses, devices, and interrupts; microcode and assembly language; virtual machines; the roles of the assembler, linker, compiler, and operating system; technological trends and the future of computing hardware. Several programming assignments required.\nPrerequisites: MTH 150 Discrete Mathematics and CSC 172 Data Structures and Algorithms\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}]