[{"Title": "CSC 161-2 Introduction to Programming - Lab", "Days": "TR", "Term": "Spring 2023", "Credit": "  4.0", "Open": false, "Start": 1400, "End": 1515, "Room": "Gavett Hall Room 244", "Capacity": "50", "Enrolled": "49", "Instructor": "Andrew Read-McFarland", "Description": "Hands-on introduction to programming using the Python programming language. Covers basic programming constructs including statements, expressions, variables, conditionals, iteration, and functions, as well as object-oriented programming and graphics. Recommended for non-majors, and/or students with less math and science background. Lab and workshop required.\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "CSC 161-1 Introduction to Programming", "Days": "TR", "Term": "Spring 2023", "Credit": "  4.0", "Open": true, "Start": 1650, "End": 1805, "Room": "Hoyt Hall Room 104", "Capacity": "200", "Enrolled": "188", "Instructor": "Andrew Read-McFarland", "Description": "Hands-on introduction to programming using the Python programming language. Covers basic programming constructs including statements, expressions, variables, conditionals, iteration, and functions, as well as object-oriented programming and graphics.\nThis course is for non-majors, and/or students with less math and science background. Lab and workshop required.\nThis course may not be used for CSC major credit if completed after or at the same time as CSC171\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "CSC 170-1 Introduction to Web Development", "Days": "TR", "Term": "Spring 2023", "Credit": "  4.0", "Open": true, "Start": 1105, "End": 1220, "Room": "Goergen Hall Room 101", "Capacity": "90", "Enrolled": "85", "Instructor": "Andrew Read-McFarland", "Description": "An introduction to the World Wide Web and related technologies. Topics include HTML5 and CSS3, Progressive Enhancement, and Web page design. Emphasis is placed on fundamentals, industry standards and best practices. Additional topics include: web site construction techniques, mobile design issues, and Search Engine Optimization (SEO). Programming with JavaScript will be introduced.\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "CSC 172-1 Data Structures & Algorithms", "Days": "TR", "Term": "Spring 2023", "Credit": "  4.0", "Open": true, "Start": 1525, "End": 1640, "Room": "Hutchison Hall Room 141", "Capacity": "200", "Enrolled": "163", "Instructor": "Eustrat Zhupa", "Description": "Abstract data types (e.g., sets, mappings, and graphs) and their implementation as concrete data structures in Java. Analysis of the running times of programs operating on such data structures, and basic techniques for program design, analysis, and proof of correctness (e.g., induction and recursion). \nLab and workshop required. \nPrerequisites: CSC 171 or equivalent, MATH 150. May be taken concurrently with MATH 150 if CSC 171 prerequisite is satisfied.\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "CSC 278-1 Computer Security Foundations", "Days": "MW", "Term": "Spring 2023", "Credit": "  4.0", "Open": true, "Start": 1815, "End": 1930, "Room": "Hylan Building Room 101", "Capacity": "40", "Enrolled": "10", "Instructor": "John Criswell", "Description": "This course will teach students the foundations of computer security. Students will learn what security is, the design principles of secure systems, how security is enforced, and how security is compromised. Topics include access controls, information flow, basic applications of cryptography, buffer overflow attacks, and malware. \nPrerequisites: CSC 252 or CSC 452 or ECE 200.\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}, {"Title": "ASTR 105-01 Intro to the Milky Way Galaxy", "Days": "TR", "Term": "Fall 2022", "Credit": "  4.0", "Open": true, "Start": 1400, "End": 1515, "Room": "Gavett Hall Room 202", "Capacity": "60", "Enrolled": "23", "Instructor": "Adam Frank", "Description": "In this course we introduce students to our home galaxy, the Milky Way, and use the structure and contents of this normal galaxy to illustrate the origins of stars like the Sun, the origins of the chemical elements from which we are formed, and the evolution of galaxies through the life of the Universe. The emphasis in the presentation is on the descriptive astronomy and the physical principles describing the operation of the various celestial objects, with a minimum of mathematical detail.\n", "Restrictions": [], "Offered": ["Fall", "", ""], "Showing": true}, {"Title": "CSC 262-1 Computational Introduction to Statistics", "Days": "TR", "Term": "Fall 2023", "Credit": "  4.0", "Open": true, "Start": 1400, "End": 1515, "Room": "Wegmans Room 1400", "Capacity": "150", "Enrolled": "44", "Instructor": "Bruce Blaine", "Description": "This course will cover foundational concepts in descriptive analyses, probability, and statistical inference. \nTopics to be covered include data exploration through descriptive statistics (with a heavy emphasis on using R for such analyses), elementary probability, diagnostic testing, combinatorics, random variables,  elementary distribution theory, statistical inference, and statistical modeling. The inference portion of the course will focus on building and applying hypothesis tests and confidence intervals for population means, proportions, variances, and correlations. Non-parametric alternatives will also be introduced. The modeling portion of the course will include ANOVA, and simple and multiple regression and their respective computational methods. Students will be introduced to the R statistical computing environment. \nPREREQUISITES: MTH 150 or MTH 150A; AND MTH 142 or MTH 161 or MTH 171\n", "Restrictions": [], "Offered": ["Fall", "Spring", "Summer"], "Showing": true}]